<script setup lang="ts">
import type { AccordionItem } from '@nuxt/ui'

const items: AccordionItem[] = [
  {
    label: 'Что делать, если маршрутная квитанция не пришла на почту?',
    content:
        'Письмо с маршрутной квитанцией мы мгновенно отправляем на почту, указанную при оформлении. Если письма нет в папке «Входящие», мы рекомендуем проверить папку «Спам». В случае, если и в ней письма не нашлось, то скачать маршрутную квитанцию можно в разделе в личном кабинете, заполнив все необходимые строки формы. Заходить в личный кабинет для этого не нужно. Если возникают сложности, свяжитесь со службой поддержки в разделе «Контакты» на сайте.',
  },
  {
    label: 'Как мне вернуть или обменять билет?',
    content:
        'Чтобы оформить запрос, перейдите в раздел заказы и выберите нужный.',
  },
  {
    label: 'Как мне поменять информацию в билете?',
    content:
        'Чтобы уточнить возможность корректировки данных, перейдите в раздел заказов, выберите нужный и нажмите Другие действия.',
  },
  {
    label: 'Как найти подходящий мне отель или апартаменты?',
    content:
        'В поле "Направление" введите название города, в котором хотите остановиться, или название конкретного объекта размещения — отеля, апартаментов, глэмпинга и т. д. на главной странице в поле «Направление».',
  },
  {
    label: 'Как получить подтверждение бронирования?',
    content:
        'Сразу же после оформления бронирования вам на почту придёт письмо с ваучером (если не нашли письмо во входящих, стоит проверить спам). Посмотреть детали заказа можно также в личном кабинете во вкладке «Мои бронирования». Если вы хотите получить подтверждение непосредственно от сотрудника отеля и узнать внутренний номер бронирования, пожалуйста, обратитесь в службу поддержки. В запросе укажите подробно вопрос, адрес и название отеля, номер бронирования и даты поездки.',
  },
  {
    label: 'Как изменить бронирование?',
    content:
        `Первым делом определите, какое у вас бронирование: возвратное или невозвратное.

Возвратное бронирование — это бронирование, в котором есть период бесплатной отмены. Информацию о том, есть ли у вашего бронирования период бесплатной отмены и когда он заканчивается, можно увидеть в пункте «Условия отмены бронирования» в разделе «Мои бронирования».

Невозвратным считается бронирование, в котором при отмене стоимость не возвращается или срок бесплатной отмены уже истёк.

Изменение возвратного бронирования:
• Отмените бронирование в личном кабинете.
• Оформите новое бронирование с нужными параметрами.

Изменение невозвратного бронирования:
• Обратитесь в службу поддержки любым удобным способом.
• Укажите в запросе номер бронирования, даты поездки, название объекта размещения, какие изменения вы хотите внести и по каким причинам — это поможет нам при согласовании.

Что можно изменить:
• Имена и количество гостей
• Даты проживания
• Категорию номера
• Тип питания
• Количество номеров в заказе (в меньшую сторону)
• Время заезда или выезда

Важно: нам потребуется согласовать изменения с представителем отеля или поставщиком, и часто это происходит в несколько этапов. Чем раньше вы отправите запрос, тем выше шанс на успешные изменения.`,
  },
]
</script>

<template>
  <div class="container pt-10">
    <div class="text-xl lg:text-3xl font-semibold mb-4">
      У нас есть ответы на вопросы!
    </div>

    <div class="text-[#4A5663] mb-4 text-sm lg:text-base">
      Ответы на самые популярные вопросы мы оставили ниже. Остальные ответы
      хранятся в нашей
      базе знаний
      . Если вы не нашли то, что вам нужно, напишите
      нам в чат. Мы с радостью ответим на любой, даже самый сложный вопрос
    </div>

    <UAccordion
        :items="items"
        :ui="{
        item: 'border-b border-[#D4D6DD]',
        label: 'text-base lg:text-lg'
      }"
    >
      <template #body="{ item }">
        <div class="whitespace-pre-line text-[#4A5663] pb-4">
          {{ item.content }}
        </div>
      </template>

      <template #trailing>
        <div class="ml-auto p-2 rounded-lg bg-[#EDEEF3] flex-center">
          <Icon class="text-[#181E25] w-3 h-3 group-data-[state=open]:rotate-180 transition-transform duration-200" name="c:carret" />
        </div>
      </template>
    </UAccordion>

    <div class="flex flex-col gap-4 opacity-80 mb-8 text-sm mt-8">
      <div class="font-bold">
        Как получить помощь, если возникли вопросы?
      </div>

      <div class="text-sm">
        Все вопросы по авиабилетам и отелям решаются через поддержку сервисов:
      </div>

      <div class="flex flex-col gap-1">
        <div class="flex items-center gap-2">
          <div class="font-bold">
            Авиабилеты:
          </div>

          <a class="font-light" href="tel:+74957974797">
            +7 (495) 797-47-97
          </a>
        </div>

        <a class="font-light" href="mailto:support@agent.ru">
          support@agent.ru
        </a>
      </div>

      <div class="flex flex-col gap-1">
        <div class="flex items-center gap-2">
          <div class="font-bold">
            Отели:
          </div>

          <a class="font-light" href="tel:88003003767">
            8 (800) 300-37-67
          </a>
        </div>

        <a class="font-light" href="mailto:help@tourist-tours.ru">
          help@tourist-tours.ru
        </a>
      </div>
    </div>
  </div>
</template>

<style scoped></style>